<script setup lang="ts"></script>

<template>
  <h1>四大名著</h1>
  <hr />
  <ul>
    <li><strong style="font-weight: bold">西游记</strong></li>
    该小说主要讲述了孙悟空出世，跟随菩提祖师学艺及大闹天宫后，遇见了唐僧、猪八戒、沙僧和白龙马，西行取经，一路上历经艰险，降妖除魔，经历了九九八十一难，终于到达西天见到如来佛祖，最终五圣成真的故事。该小说以“玄奘取经”这一历史事件为蓝本，经作者的艺术加工，深刻地描绘出明代百姓的社会生活状况。
    <li><strong style="font-weight: bold">三国演义</strong></li>
    《三国演义》大致分为黄巾起义、董卓之乱、群雄逐鹿、三国鼎立、三国归晋五大部分，描写了从东汉末年到西晋初年之间近百年的历史风云，以描写战争为主，描述了东汉末年的群雄割据混战和魏、蜀、吴三国之间的政治和军事斗争，最终司马炎一统三国，建立晋朝的故事，反映了三国时代各类社会斗争与矛盾的转化，并概括了这一时代的历史巨变，塑造了一群叱咤风云的三国英雄人物。
    <li><strong style="font-weight: bold">红楼梦</strong></li>
    《红楼梦》，是中国古代章回体长篇虚构小说，中国古典四大名著之首。其通行本共120回，一般认为前80回是清代作家曹雪芹所著，后40回作者为无名氏，由高鹗、程伟元整理。小说以贾、史、王、薛四大家族的兴衰为背景，以大荒山青埂峰下顽石幻化的通灵宝玉为视角，以贾宝玉与林黛玉、薛宝钗的爱情婚姻悲剧为主线，描绘了一些闺阁佳人的人生百态，展现了真正的人性美和悲剧美，是一部从各个角度展现中国古代社会百态的史诗性著作。
    <li><strong style="font-weight: bold">水浒传</strong></li>
    全书通过描写梁山好汉反抗欺压、水泊梁山壮大和受宋朝招安，以及受招安后为宋朝征战，最终消亡的宏大故事，艺术地反映了中国历史上宋江起义从发生、发展直至失败的全过程，深刻揭示了起义的社会根源，满腔热情地歌颂了起义英雄的反抗斗争和他们的社会理想，也具体揭示了起义失败的内在历史原因。
  </ul>
  <hr />
  <h1>物品清单</h1>
  <ul>
    <li>
      <span style="font-weight: bold">蔬菜</span>
      <ul>
        <li>白菜</li>
        <li>萝卜</li>
        <li>黄瓜</li>
      </ul>
    </li>
    <li>
      <span style="font-weight: bold">水果</span>
      <ul>
        <li>苹果</li>
        <li>桃子</li>
        <li>香蕉</li>
      </ul>
    </li>
  </ul>
  <hr />
  <h1>音乐排行榜</h1>
  <ol>
    <li>演员</li>
    <li>最炫民族风</li>
    <li>忘情水</li>
    <li>霍元甲</li>
  </ol>
  <hr />
  <h1>个人简历</h1>
  <img src="/src/assets/goblin-trolll.gif" alt="" />
  <ul style="list-style-type: none">
    <li style="font-weight: bold">张三</li>
    这是一段示例文本，这是一段示例文本，这是一段示例文本，这是一段示例文本，这是一段示例文本。
  </ul>
</template>
